In [1]:
import pandas as pd

In [78]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [55]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    salaries = employee['salary'].drop_duplicates().sort_values(ascending=True)
    second = salaries.iloc[1] if len(salaries) >= 2 else None
    return pd.DataFrame({'SecondHighestSalary': [second]})

In [56]:
second_highest_salary(employee)

  SecondHighestSalary
0                None

In [77]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    salaries = employee['salary'].drop_duplicates().sort_values(ascending=True)
    if len(salaries) >= N:
        nth = salaries.iloc[N-1]
    elif len(salaries) == 1 and N == 1:
        nth = salaries.iloc[0]
    else:
        nth = None
    col_name = f"getNthHighestSalary({N})"
    return pd.DataFrame({col_name: [nth]})
nth_highest_salary(employee, 3)

  getNthHighestSalary(3)
0                   None

In [80]:
employee['salary'].drop_duplicates().sort_values(ascending=True).iloc[1-1]

np.int64(100)

### Rank score

In [104]:
import pandas as pd

data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    score = scores['score'].sort_values(ascending=False, )
    r = 1; rank = [0]*len(score)
    for idx in range(len(score)):
        if idx == 0:
            rank[idx] = r
        else:
            if score.iloc[idx] == score.iloc[idx-1]:
                rank[idx] = r
            else:
                r += 1
                rank[idx] = r
    return pd.DataFrame({'score': score, 'rank': rank})
order_scores(scores)

   score  rank
4    4.0     1
2    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

최적화

In [ ]:
result = scores.sort_values('score', ascending=False)
result['rank'] = result['score'].rank(method='dense', ascending=False).astype(int)
result[['score', 'rank']]

   id  score
4   5    4.0
2   3    4.0
3   4   3.85
1   2   3.65
5   6   3.65
0   1    3.5

In [121]:
data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

scores['rank'] = scores['score'].rank(method='dense', ascending=False).astype(int)
scores[['score', 'rank']].sort_values(by='rank',ascending=True)

   score  rank
2    4.0     1
4    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

sample code

In [122]:
import pandas as pd

def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    scores["rank"] = scores["score"].rank(method="dense", ascending=False).astype(int)
    return scores[["score", "rank"]].sort_values(by="score", ascending=False)
order_scores(scores)

   score  rank
4    4.0     1
2    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

### Consecutive numbers

Find all numbers that appear at least three times consecutively.

Return the result table in any order.

The result format is in the following example.

In [ ]:
import pandas as pd

data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
    n = logs['num']
    cn = []; cnt = 0; check = logs['num']
    for i in range(len(check)-1):
        if check[i] == check[i+1]:
            cnt += 1
        else:
            cn

claude 최적화

**shift** 사용법

In [4]:
data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
    logs = logs.sort_values(by='id', ascending=True)
    check = (logs['num'] == logs['num'].shift(-1)) & (logs['num'] == logs['num'].shift(-2))
    con_nums = logs.loc[check, 'num'].unique()
    return pd.DataFrame({'ConsecutiveNums': con_nums})
consecutive_numbers(logs)

   ConsecutiveNums
0                1

In [141]:
print(logs['num'] == logs['num'].shift(-1))
print(logs['num'] == logs['num'].shift(-2))
(logs['num'] == logs['num'].shift(-1)) & (logs['num'] == logs['num'].shift(-2))

0     True
1     True
2    False
3    False
4    False
5     True
6     <NA>
Name: num, dtype: boolean
0     True
1    False
2     True
3     True
4    False
5     <NA>
6     <NA>
Name: num, dtype: boolean

0     True
1    False
2    False
3    False
4    False
5     <NA>
6     <NA>
Name: num, dtype: boolean

### Employees earning more than their managers

In [2]:
import pandas as pd
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

# def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
#     merged = employee.merge(employee, left_on='managerId', right_on=)

In [3]:
employee.merge(
    employee, 
    left_on='managerId', 
    right_on='id', 
    suffixes=('', '_manager')
)

,id,name,salary,managerId,id_manager,name_manager,salary_manager,managerId_manager
0,1,Joe,70000,3,3,Sam,60000,<NA>
1,2,Henry,80000,4,4,Max,90000,<NA>

In [4]:
merged = employee.merge(employee, left_on='managerId', right_on='id', suffixes=('','_manager'))
ans = merged[merged['salary'] > merged['salary_manager']]
ans[['name']].rename(columns={'name': 'Employee'})

  Employee
0      Joe

In [5]:
merged = employee.merge(employee, left_on='managerId', right_on='id', suffixes=('','_manager'))
ans = merged[merged['salary'] > merged['salary_manager']]

In [ ]:
pd.DataFrame({'Employee': ans.name})

  employee
0      Joe

In [13]:
employee.merge(employee, left_on='managerId', right_on='id')

   id_x name_x  salary_x  managerId_x  id_y name_y  salary_y  managerId_y
0     1    Joe     70000            3     3    Sam     60000         <NA>
1     2  Henry     80000            4     4    Max     90000         <NA>

## Duplicate Emails

Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

Return the result table in any order.

The result format is in the following example.

**value_counts()**

In [86]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [89]:
pd.DataFrame(person['email'].value_counts()[person['email'].value_counts() > 1])

         count
email
a@b.com      2

In [61]:
cnts = person['email'].value_counts()
filtered = cnts[cnts > 1]
filtered.index

Index(['a@b.com'], dtype='object', name='email')

## Customers Who Never Order

Write a solution to find all customers who never order anything.

Return the result table in any order.

The result format is in the following example.

**isin**

In [94]:
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})
display(customers) 
display(orders)

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

   id  customerId
0   1           3
1   2           1

내 답안

In [ ]:
def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    good = customers.merge(orders, left_on='id', right_on='customerId')
    bad = []
    for name in customers['name']:
        if name not in list(good['name']):
            bad.append(name)
    return pd.DataFrame({'Customers': bad})

틀린 test case: id는 다른데 이름은 같은 동명이인일 때

In [114]:
data = [[1, 'James'], [2, 'James']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})
display(customers) 
display(orders)

   id   name
0   1  James
1   2  James

   id  customerId
0   1           1

In [116]:
good = set(orders['customerId'])
bad = customers[~customers['id'].isin(good)]
bad[['name']].rename(columns={'name': 'Customers'})

  Customers
1     James

## Delete duplicate emails

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

**duplicates(keep='first', inplace=True)**

In [125]:
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})
person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [127]:
person.sort_values('id', inplace=True)
person.drop_duplicates('email', keep='first', inplace=True)
person

   id             email
0   1  john@example.com
1   2   bob@example.com

In [128]:
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values('id', inplace=True)
    person.drop_duplicates('email', keep='first', inplace=True)
    return person

## Rising Temperature

Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

The result format is in the following example.

**pd.Timedelta(days=1)**

**shift(1)**

**날짜가 딱 하루 차이가 나야함**

In [193]:
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})
weather

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           30

In [192]:
data = [[1, '2000-12-16', 3], [2, '2000-12-15', -1]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

data = [[1, '2000-12-14', 3], [2, '2000-12-16', 5]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

In [199]:
weather.sort_values('recordDate', inplace=True)
weather['prev_date'] = weather['recordDate'] - pd.Timedelta(days=1)
merged = weather.merge(weather, left_on='prev_date', right_on='recordDate', suffixes=('', '_prev'))
merged[merged['temperature'] > merged['temperature_prev']][['id']].rename(columns={'id': 'Id'})
# weather[weather['temperature'] > weather['yesterday']][['id']].rename(columns={'id': 'Id'})

   Id
0   2
2   4

In [200]:
weather.merge(weather, left_on='recordDate', right_on='prev_date', suffixes=('', '_prev'))

,id,recordDate,temperature,prev_date,id_prev,recordDate_prev,temperature_prev,prev_date_prev
0,1,2015-01-01,10,2014-12-31,2,2015-01-02,25,2015-01-01
1,2,2015-01-02,25,2015-01-01,3,2015-01-03,20,2015-01-02
2,3,2015-01-03,20,2015-01-02,4,2015-01-04,30,2015-01-03

In [201]:
weather.merge(weather, left_on='prev_date', right_on='recordDate', suffixes=('', '_prev'))

,id,recordDate,temperature,prev_date,id_prev,recordDate_prev,temperature_prev,prev_date_prev
0,2,2015-01-02,25,2015-01-01,1,2015-01-01,10,2014-12-31
1,3,2015-01-03,20,2015-01-02,2,2015-01-02,25,2015-01-01
2,4,2015-01-04,30,2015-01-03,3,2015-01-03,20,2015-01-02

In [161]:
weather.sort_values('recordDate', inplace=True)
idx = []
for i in range(weather.shape[0]-1):
    if weather.loc[i, 'temperature'] < weather.loc[i+1, 'temperature']:
        idx.append(weather.loc[i+1]['id'])
weather[weather['id'].isin(idx)][['id']].rename(columns={'id': 'Id'})

Empty DataFrame
Columns: [Id]
Index: []

## Game play analysis

Write a solution to find the first login date for each player.

Return the result table in any order.

The result format is in the following example.

In [203]:
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})
activity

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-05-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [210]:
activity.sort_values('event_date', inplace=True)
new_activity = activity.drop_duplicates('player_id', keep='first')
new_activity[['player_id', 'event_date']].rename(columns={'event_date': 'first_login'})

   player_id first_login
0          1  2016-03-01
3          3  2016-03-02
2          2  2017-06-25

## 262. Trip and Users

The cancellation rate is computed by dividing the number of canceled (by client or driver) requests with unbanned users by the total number of requests with unbanned users on that day.

Write a solution to find the cancellation rate of requests with unbanned users (both client and driver must not be banned) each day between "2013-10-01" and "2013-10-03" with at least one trip. Round Cancellation Rate to two decimal points.

Return the result table in any order.

The result format is in the following example.

## 550. Game play analysis

Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. In other words, you need to determine the number of players who logged in on the day immediately following their initial login, and divide it by the number of total players.

The result format is in the following example.

**groupby().first()** -> 묶인 데이터 중 첫번째 데이터만 반환

In [9]:
import pandas as pd

data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-03-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})
activity

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-03-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [2]:
def gameplay_analysis(activity: pd.DataFrame) -> pd.DataFrame:
    activity['right_after_event_date'] = activity['event_date'] + pd.Timedelta(days=1)
    merged = activity.merge(activity, left_on='right_after_event_date', right_on='event_date')
    v = round(len(merged['player_id_x'].unique()) / len(activity['player_id'].unique()),2)
    return pd.DataFrame({'fraction': [v]})
gameplay_analysis(activity)

   fraction
0      0.33

In [3]:
activity.sort_values(['player_id','event_date'], inplace=True)
activity['right_after_event_date'] = activity['event_date'] + pd.Timedelta(days=1)
activity['check'] = activity['right_after_event_date'].shift(1)
target = activity[activity['event_date'] == activity['check']]
target

,player_id,device_id,event_date,games_played,right_after_event_date,check
1,1,2,2016-03-02,6,2016-03-03,2016-03-02

In [10]:
activity_sorted = activity.sort_values(['player_id', 'event_date'])
first_login = activity_sorted.groupby('player_id').first()['event_date']
activity_sorted

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-03-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [11]:
activity_sorted.groupby('player_id').first()

           device_id event_date  games_played
player_id
1                  2 2016-03-01             5
2                  3 2017-06-25             1
3                  1 2016-03-02             0

In [12]:
next_day_login = pd.DataFrame({
    'player_id': first_login.index,
    'target_date': first_login.values + pd.Timedelta(days=1)
})
next_day_login

   player_id target_date
0          1  2016-03-02
1          2  2017-06-26
2          3  2016-03-03

In [16]:
actual_logins = set(zip(activity['player_id'], activity['event_date']))
expected_logins = set(zip(next_day_login['player_id'], next_day_login['target_date']))
display(actual_logins)
display(expected_logins)

{(np.int64(1), Timestamp('2016-03-01 00:00:00')),
 (np.int64(1), Timestamp('2016-03-02 00:00:00')),
 (np.int64(2), Timestamp('2017-06-25 00:00:00')),
 (np.int64(3), Timestamp('2016-03-02 00:00:00')),
 (np.int64(3), Timestamp('2018-07-03 00:00:00'))}

{(np.int64(1), Timestamp('2016-03-02 00:00:00')),
 (np.int64(2), Timestamp('2017-06-26 00:00:00')),
 (np.int64(3), Timestamp('2016-03-03 00:00:00'))}

In [ ]:
def game_play_analysis_iv(activity: pd.DataFrame) -> pd.DataFrame:
    # 플레이어별 첫 로그인과 다음 날 데이터 준비
    activity_sorted = activity.sort_values(['player_id', 'event_date'])
    first_login = activity_sorted.groupby('player_id').first()['event_date']
    
    # 첫 로그인 + 1일 데이터셋 생성
    next_day_login = pd.DataFrame({
        'player_id': first_login.index,
        'target_date': first_login.values + pd.Timedelta(days=1)
    })
    
    # 실제 로그인 데이터와 매칭
    actual_logins = set(zip(activity['player_id'], activity['event_date']))
    expected_logins = set(zip(next_day_login['player_id'], next_day_login['target_date']))
    
    # 교집합으로 재방문자 계산
    retained_count = len(actual_logins & expected_logins)
    total_count = len(first_login)
    
    fraction = round(retained_count / total_count, 2)
    return pd.DataFrame({'fraction': [fraction]})

## 577. Employee Bonus

Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

Return the result table in any order.

The result format is in the following example.

**merge에서 left_on, right_on은 서로 열명이 다를 때 쓰고, 열 명이 같다면 그냥 on을 사용**

In [17]:
data = [[3, 'Brad', None, 4000], [1, 'John', 3, 1000], [2, 'Dan', 3, 2000], [4, 'Thomas', 3, 4000]]
employee = pd.DataFrame(data, columns=['empId', 'name', 'supervisor', 'salary']).astype({'empId':'Int64', 'name':'object', 'supervisor':'Int64', 'salary':'Int64'})
data = [[2, 500], [4, 2000]]
bonus = pd.DataFrame(data, columns=['empId', 'bonus']).astype({'empId':'Int64', 'bonus':'Int64'})

In [ ]:
def employee_bonus(employee: pd.DataFrame, bonus: pd.DataFrame) -> pd.DataFrame:
    employee_bonus = employee.merge(bonus, on='empId', how='left')
    return employee_bonus.loc[(employee_bonus['bonus'].isna()) | (employee_bonus['bonus'] < 1000)][['name','bonus']]

In [18]:
employee.merge(bonus, left_on='empId', right_on='empId', suffixes=('','_bonus'))

   empId    name  supervisor  salary  bonus
0      2     Dan           3    2000    500
1      4  Thomas           3    4000   2000

In [71]:
employee.merge(bonus, on='empId', how='left')

   empId    name  supervisor  salary  bonus
0      3    Brad        <NA>    4000   <NA>
1      1    John           3    1000   <NA>
2      2     Dan           3    2000    500
3      4  Thomas           3    4000   2000

In [72]:
employee_bonus = employee.merge(bonus, on='empId', how='left')
employee_bonus.loc[(employee_bonus['bonus'].isna()) | (employee_bonus['bonus'] < 1000)][['name','bonus']]

   name  bonus
0  Brad   <NA>
1  John   <NA>
2   Dan    500

## 584. Find Customer Referee

Find the names of the customer that are either:

referred by any customer with id != 2.

not referred by any customer.

Return the result table in any order.

The result format is in the following example.

In [73]:
data = [[1, 'Will', None], [2, 'Jane', None], [3, 'Alex', 2], [4, 'Bill', None], [5, 'Zack', 1], [6, 'Mark', 2]]
customer = pd.DataFrame(data, columns=['id', 'name', 'referee_id']).astype({'id':'Int64', 'name':'object', 'referee_id':'Int64'})

In [ ]:
def find_customer_referee(customer: pd.DataFrame) -> pd.DataFrame:
    refby = customer[(customer['referee_id'] != 2) | customer['referee_id'].isna()]['name']
    return pd.DataFrame(refby)

In [78]:
refby = customer[(customer['referee_id'] != 2) | customer['referee_id'].isna()]
refby['name']

0    Will
1    Jane
3    Bill
4    Zack
Name: name, dtype: object

## 585. Investment in 2016

Write a solution to report the sum of all total investment values in 2016 tiv_2016, for all policyholders who:

- have the same tiv_2015 value as one or more other policyholders, and

- are not located in the same city as any other policyholder (i.e., the (lat, lon) attribute pairs must be unique).

Round tiv_2016 to two decimal places.

The result format is in the following example.

In [4]:
import pandas as pd

In [27]:
data = [[1, 10, 5, 10, 10], [2, 20, 20, 20, 20], [3, 10, 30, 20, 20], [4, 10, 40, 40, 40]]
insurance = pd.DataFrame(data, columns=['pid', 'tiv_2015', 'tiv_2016', 'lat', 'lon']).astype({'pid':'Int64', 'tiv_2015':'Float64', 'tiv_2016':'Float64', 'lat':'Float64', 'lon':'Float64'})
insurance

   pid  tiv_2015  tiv_2016   lat   lon
0    1      10.0       5.0  10.0  10.0
1    2      20.0      20.0  20.0  20.0
2    3      10.0      30.0  20.0  20.0
3    4      10.0      40.0  40.0  40.0

In [18]:
tiv_2015_counts = insurance['tiv_2015'].value_counts()
tiv_2015_duplicate = tiv_2015_counts[tiv_2015_counts > 1].index
c1 = insurance['tiv_2015'].isin(tiv_2015_duplicate)
c1

0     True
1    False
2     True
3     True
Name: tiv_2015, dtype: boolean

In [19]:
location_counts = insurance.groupby(['lat', 'lon']).size()
unique_locations = location_counts[location_counts == 1].index
c2 = insurance.set_index(['lat', 'lon']).index.isin(unique_locations)
c2

array([ True, False, False,  True])

In [21]:
valid_policies = insurance[c1 & c2]
valid_policies

   pid  tiv_2015  tiv_2016   lat   lon
0    1      10.0       5.0  10.0  10.0
3    4      10.0      40.0  40.0  40.0

In [17]:
insurance.groupby(['lat', 'lon']).size()

lat   lon
10.0  10.0    1
20.0  20.0    2
40.0  40.0    1
dtype: int64

In [41]:
c1 = insurance.duplicated(subset=['tiv_2015'], keep=False)
c2 = ~insurance.duplicated(subset=['lat','lon'], keep=False)
c = insurance[c1 & c2]
c['tiv_2016'].sum()

np.float64(45.0)

In [ ]:
insurance.duplicated(subset=[])

   pid  tiv_2015  tiv_2016   lat   lon
0    1      10.0       5.0  10.0  10.0
1    2      20.0      20.0  20.0  20.0
2    3      10.0      30.0  20.0  20.0
3    4      10.0      40.0  40.0  40.0

In [42]:
[-4,-1,0,3,10]**2

TypeError: unsupported operand type(s) for ** or pow(): 'list' and 'int'

In [ ]:
nums = [-4,-1,0,3,10]
n = len(nums)
result = [0] * n
left = 0
right = n - 1
position = n - 1  # Fill result array from right to left

while left <= right:
    left_square = nums[left] * nums[left]
    right_square = nums[right] * nums[right]
    
    # Place the larger square at current position
    if left_square > right_square:
        result[position] = left_square
        left += 1i
    else:
        result[position] = right_square
        right -= 1
    
    position -= 1

result

[0, 1, 9, 16, 100]

In [ ]:
[9, 1, 0, 100, 16]
[0, 0, 0, 0, 0]
[0, 0, 0, 0, 16]
[]